app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2016-07-05 20:56:33.987313"], ["updated_at", "2016-07-05 20:56:33.987313"]]
---
  def create
    @student = Student.new(post_params(:first_name, :last_name))
    @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2016-07-05 21:33:12.969964"], ["id", 1]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(post_params(:first_name, :last_name))